analysis_runs/case_simple_box_0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class dictionary;
  location "system";
  object controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application
    interFoam; // Solver for 2 incompressible, isothermal immiscible fluids

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 0.05; // Simulation duration in seconds

deltaT 0.01; // Initial time step size

writeControl timeStep;

writeInterval 1; // Write data every N time steps

purgeWrite 0; // 0 = Keep all time directories

writeFormat ascii;

writePrecision 6;

writeCompression off;

timeFormat general;

timePrecision 6;

runTimeModifiable true; // Allow modifying dictionaries while running

adjustTimeStep true; // Automatically adjust DeltaT based on Courant number

maxCo 1.0;      // Maximum Courant number allowed
maxAlphaCo 1.0; // Maximum Courant number for phase interface

maxDeltaT 1; // Upper limit for DeltaT

// Function objects for runtime post-processing
functions {
  forces
  {
    type            forces;
    libs            ( "libforces.so" );
    writeControl    timeStep;
    writeInterval   1;

    patches         (hull);
    p               p_rgh;
    U               U;
    rho             rhoInf;
    rhoInf          1025;
    CofR            (0 0 0);
  }

  // Wave probes alongside the hull to measure elevation
  waveProbes {
    type            probes;
    libs            ( "libsampling.so" );
    writeControl    timeStep;
    writeInterval   1;
    fields          ( p_rgh alpha.water );
    probeLocations
    (
        ( 10 5 0 )
        ( 10 6 0 )
        ( 10 7 0 )
    );
  }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
