analysis_runs/case_simple_box_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          1528;
        startFace       631019;
    }
    outlet
    {
        type            patch;
        nFaces          1528;
        startFace       632547;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       634075;
    }
    top
    {
        type            patch;
        nFaces          800;
        startFace       634875;
    }
    side_right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       635675;
    }
    side_left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       636475;
    }
    hull
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2464;
        startFace       637275;
    }
)

// ************************************************************************* //
