analysis_runs/case_simple_box_0/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class dictionary;
  object surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hull.stl {
  extractionMethod
      extractFromSurface; // Extract features directly from STL surface

  includedAngle 150; // Angle (degrees) to detect sharp edges (150 detects edges
                     // > 30 deg deviation)

  subsetFeatures {
    nonManifoldEdges no; // Keep non-manifold edges
    openEdges yes;       // Extract open edges (boundaries of surface)
  }

  writeObj yes; // Write extracted features to .obj format for visualization
}

// ************************************************************************* //
